Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fcw.h
/*
 * Component description for FCW
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2024-07-26T17:56:39Z  */
#ifndef _PIC32CMGC00_FCW_COMPONENT_H_
#define _PIC32CMGC00_FCW_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR FCW                       */
/* ************************************************************************** */

/* -------- FCW_CTRLA : (FCW Offset: 0x00) (R/W 32) Control A REGISTER -------- */
#define FCW_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (FCW_CTRLA) Control A REGISTER  Reset Value */

#define FCW_CTRLA_PRIV_Pos                    _UINT32_(2)                                          /* (FCW_CTRLA) Privileged Access Only Position */
#define FCW_CTRLA_PRIV_Msk                    (_UINT32_(0x1) << FCW_CTRLA_PRIV_Pos)                /* (FCW_CTRLA) Privileged Access Only Mask */
#define FCW_CTRLA_PRIV(value)                 (FCW_CTRLA_PRIV_Msk & (_UINT32_(value) << FCW_CTRLA_PRIV_Pos)) /* Assignment of value for PRIV in the FCW_CTRLA register */
#define   FCW_CTRLA_PRIV_DISABLE_Val          _UINT32_(0x0)                                        /* (FCW_CTRLA) Macro register accessible in privileged and unprivileged accesses.  */
#define   FCW_CTRLA_PRIV_ENABLE_Val           _UINT32_(0x1)                                        /* (FCW_CTRLA) Macro registers only accessible in privileged accesses  */
#define FCW_CTRLA_PRIV_DISABLE                (FCW_CTRLA_PRIV_DISABLE_Val << FCW_CTRLA_PRIV_Pos)   /* (FCW_CTRLA) Macro register accessible in privileged and unprivileged accesses. Position */
#define FCW_CTRLA_PRIV_ENABLE                 (FCW_CTRLA_PRIV_ENABLE_Val << FCW_CTRLA_PRIV_Pos)    /* (FCW_CTRLA) Macro registers only accessible in privileged accesses Position */
#define FCW_CTRLA_Msk                         _UINT32_(0x00000004)                                 /* (FCW_CTRLA) Register Mask  */


/* -------- FCW_CTRLOP : (FCW Offset: 0x04) (R/W 32) Control Operation REGISTER -------- */
#define FCW_CTRLOP_RESETVALUE                 _UINT32_(0x00)                                       /*  (FCW_CTRLOP) Control Operation REGISTER  Reset Value */

#define FCW_CTRLOP_NVMOP_Pos                  _UINT32_(0)                                          /* (FCW_CTRLOP) NVM Operation Position */
#define FCW_CTRLOP_NVMOP_Msk                  (_UINT32_(0xF) << FCW_CTRLOP_NVMOP_Pos)              /* (FCW_CTRLOP) NVM Operation Mask */
#define FCW_CTRLOP_NVMOP(value)               (FCW_CTRLOP_NVMOP_Msk & (_UINT32_(value) << FCW_CTRLOP_NVMOP_Pos)) /* Assignment of value for NVMOP in the FCW_CTRLOP register */
#define   FCW_CTRLOP_NVMOP_NOP_Val            _UINT32_(0x0)                                        /* (FCW_CTRLOP) No Operation  */
#define   FCW_CTRLOP_NVMOP_SINGLEWRITE_Val    _UINT32_(0x1)                                        /* (FCW_CTRLOP) Single (Word) Program Operation: Programs word selected by ADDR  */
#define   FCW_CTRLOP_NVMOP_QUADWRITE_Val      _UINT32_(0x2)                                        /* (FCW_CTRLOP) Quad (Word) Program Operation: Programs flash word selected by ADDR  */
#define   FCW_CTRLOP_NVMOP_ROWWRITE_Val       _UINT32_(0x3)                                        /* (FCW_CTRLOP) Row Write Operation: Programs row selected by ADDR  */
#define   FCW_CTRLOP_NVMOP_PAGEERASE_Val      _UINT32_(0x4)                                        /* (FCW_CTRLOP) Page Erase Operation: Erases page selected by ADDR  */
#define   FCW_CTRLOP_NVMOP_LPFMERASE_Val      _UINT32_(0x5)                                        /* (FCW_CTRLOP) Lower PFM Erase Operation: (RSVD NVMOP for Single Panel Devices)  */
#define   FCW_CTRLOP_NVMOP_UPFMERASE_Val      _UINT32_(0x6)                                        /* (FCW_CTRLOP) Upper PFM Erase Operation: (RSVD NVMOP for Single Panel Devices)  */
#define   FCW_CTRLOP_NVMOP_PFMERASE_Val       _UINT32_(0x7)                                        /* (FCW_CTRLOP) PFM Erase Operation: Upper &amp; Lower PFM Erase  */
#define   FCW_CTRLOP_NVMOP_CE_Val             _UINT32_(0xE)                                        /* (FCW_CTRLOP) Chip Erase Operation: Erases PFM+SRF, BFM, CFM (except for CalOTP, Test, VSS pages if HSM is Present, UserOTP, &amp; ROMCFG).  */
#define FCW_CTRLOP_NVMOP_NOP                  (FCW_CTRLOP_NVMOP_NOP_Val << FCW_CTRLOP_NVMOP_Pos)   /* (FCW_CTRLOP) No Operation Position */
#define FCW_CTRLOP_NVMOP_SINGLEWRITE          (FCW_CTRLOP_NVMOP_SINGLEWRITE_Val << FCW_CTRLOP_NVMOP_Pos) /* (FCW_CTRLOP) Single (Word) Program Operation: Programs word selected by ADDR Position */
#define FCW_CTRLOP_NVMOP_QUADWRITE            (FCW_CTRLOP_NVMOP_QUADWRITE_Val << FCW_CTRLOP_NVMOP_Pos) /* (FCW_CTRLOP) Quad (Word) Program Operation: Programs flash word selected by ADDR Position */
#define FCW_CTRLOP_NVMOP_ROWWRITE             (FCW_CTRLOP_NVMOP_ROWWRITE_Val << FCW_CTRLOP_NVMOP_Pos) /* (FCW_CTRLOP) Row Write Operation: Programs row selected by ADDR Position */
#define FCW_CTRLOP_NVMOP_PAGEERASE            (FCW_CTRLOP_NVMOP_PAGEERASE_Val << FCW_CTRLOP_NVMOP_Pos) /* (FCW_CTRLOP) Page Erase Operation: Erases page selected by ADDR Position */
#define FCW_CTRLOP_NVMOP_LPFMERASE            (FCW_CTRLOP_NVMOP_LPFMERASE_Val << FCW_CTRLOP_NVMOP_Pos) /* (FCW_CTRLOP) Lower PFM Erase Operation: (RSVD NVMOP for Single Panel Devices) Position */
#define FCW_CTRLOP_NVMOP_UPFMERASE            (FCW_CTRLOP_NVMOP_UPFMERASE_Val << FCW_CTRLOP_NVMOP_Pos) /* (FCW_CTRLOP) Upper PFM Erase Operation: (RSVD NVMOP for Single Panel Devices) Position */
#define FCW_CTRLOP_NVMOP_PFMERASE             (FCW_CTRLOP_NVMOP_PFMERASE_Val << FCW_CTRLOP_NVMOP_Pos) /* (FCW_CTRLOP) PFM Erase Operation: Upper &amp; Lower PFM Erase Position */
#define FCW_CTRLOP_NVMOP_CE                   (FCW_CTRLOP_NVMOP_CE_Val << FCW_CTRLOP_NVMOP_Pos)    /* (FCW_CTRLOP) Chip Erase Operation: Erases PFM+SRF, BFM, CFM (except for CalOTP, Test, VSS pages if HSM is Present, UserOTP, &amp; ROMCFG). Position */
#define FCW_CTRLOP_PREPG_Pos                  _UINT32_(7)                                          /* (FCW_CTRLOP) NVM Pre-Program Configuration Bit Position */
#define FCW_CTRLOP_PREPG_Msk                  (_UINT32_(0x1) << FCW_CTRLOP_PREPG_Pos)              /* (FCW_CTRLOP) NVM Pre-Program Configuration Bit Mask */
#define FCW_CTRLOP_PREPG(value)               (FCW_CTRLOP_PREPG_Msk & (_UINT32_(value) << FCW_CTRLOP_PREPG_Pos)) /* Assignment of value for PREPG in the FCW_CTRLOP register */
#define   FCW_CTRLOP_PREPG_DISABLE_Val        _UINT32_(0x0)                                        /* (FCW_CTRLOP) Program Operations exclude Pre-Program step  */
#define   FCW_CTRLOP_PREPG_ENABLE_Val         _UINT32_(0x1)                                        /* (FCW_CTRLOP) Program Operations include Pre-Program step  */
#define FCW_CTRLOP_PREPG_DISABLE              (FCW_CTRLOP_PREPG_DISABLE_Val << FCW_CTRLOP_PREPG_Pos) /* (FCW_CTRLOP) Program Operations exclude Pre-Program step Position */
#define FCW_CTRLOP_PREPG_ENABLE               (FCW_CTRLOP_PREPG_ENABLE_Val << FCW_CTRLOP_PREPG_Pos) /* (FCW_CTRLOP) Program Operations include Pre-Program step Position */
#define FCW_CTRLOP_Msk                        _UINT32_(0x0000008F)                                 /* (FCW_CTRLOP) Register Mask  */


