Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/fcw.h
#define FCW_INTFLAG_DONE_Pos                  _UINT32_(0)                                          /* (FCW_INTFLAG) NVM Operation Done Flag Bit Position */
#define FCW_INTFLAG_DONE_Msk                  (_UINT32_(0x1) << FCW_INTFLAG_DONE_Pos)              /* (FCW_INTFLAG) NVM Operation Done Flag Bit Mask */
#define FCW_INTFLAG_DONE(value)               (FCW_INTFLAG_DONE_Msk & (_UINT32_(value) << FCW_INTFLAG_DONE_Pos)) /* Assignment of value for DONE in the FCW_INTFLAG register */
#define   FCW_INTFLAG_DONE_0_Val              _UINT32_(0x0)                                        /* (FCW_INTFLAG) NVMOP Not Done  */
#define   FCW_INTFLAG_DONE_1_Val              _UINT32_(0x1)                                        /* (FCW_INTFLAG) NVMOP Done  */
#define FCW_INTFLAG_DONE_0                    (FCW_INTFLAG_DONE_0_Val << FCW_INTFLAG_DONE_Pos)     /* (FCW_INTFLAG) NVMOP Not Done Position */
#define FCW_INTFLAG_DONE_1                    (FCW_INTFLAG_DONE_1_Val << FCW_INTFLAG_DONE_Pos)     /* (FCW_INTFLAG) NVMOP Done Position */
#define FCW_INTFLAG_KEYERR_Pos                _UINT32_(1)                                          /* (FCW_INTFLAG) Key Error Flag Bit Position */
#define FCW_INTFLAG_KEYERR_Msk                (_UINT32_(0x1) << FCW_INTFLAG_KEYERR_Pos)            /* (FCW_INTFLAG) Key Error Flag Bit Mask */
#define FCW_INTFLAG_KEYERR(value)             (FCW_INTFLAG_KEYERR_Msk & (_UINT32_(value) << FCW_INTFLAG_KEYERR_Pos)) /* Assignment of value for KEYERR in the FCW_INTFLAG register */
#define   FCW_INTFLAG_KEYERR_0_Val            _UINT32_(0x0)                                        /* (FCW_INTFLAG) No Key Error  */
#define   FCW_INTFLAG_KEYERR_1_Val            _UINT32_(0x1)                                        /* (FCW_INTFLAG) Key Error  */
#define FCW_INTFLAG_KEYERR_0                  (FCW_INTFLAG_KEYERR_0_Val << FCW_INTFLAG_KEYERR_Pos) /* (FCW_INTFLAG) No Key Error Position */
#define FCW_INTFLAG_KEYERR_1                  (FCW_INTFLAG_KEYERR_1_Val << FCW_INTFLAG_KEYERR_Pos) /* (FCW_INTFLAG) Key Error Position */
#define FCW_INTFLAG_CFGERR_Pos                _UINT32_(2)                                          /* (FCW_INTFLAG) Configuration Error Flag Bit Position */
#define FCW_INTFLAG_CFGERR_Msk                (_UINT32_(0x1) << FCW_INTFLAG_CFGERR_Pos)            /* (FCW_INTFLAG) Configuration Error Flag Bit Mask */
#define FCW_INTFLAG_CFGERR(value)             (FCW_INTFLAG_CFGERR_Msk & (_UINT32_(value) << FCW_INTFLAG_CFGERR_Pos)) /* Assignment of value for CFGERR in the FCW_INTFLAG register */
#define   FCW_INTFLAG_CFGERR_0_Val            _UINT32_(0x0)                                        /* (FCW_INTFLAG) No CFG Error  */
#define   FCW_INTFLAG_CFGERR_1_Val            _UINT32_(0x1)                                        /* (FCW_INTFLAG) CFC Error  */
#define FCW_INTFLAG_CFGERR_0                  (FCW_INTFLAG_CFGERR_0_Val << FCW_INTFLAG_CFGERR_Pos) /* (FCW_INTFLAG) No CFG Error Position */
#define FCW_INTFLAG_CFGERR_1                  (FCW_INTFLAG_CFGERR_1_Val << FCW_INTFLAG_CFGERR_Pos) /* (FCW_INTFLAG) CFC Error Position */
#define FCW_INTFLAG_FIFOERR_Pos               _UINT32_(3)                                          /* (FCW_INTFLAG) FIFO Underrun during Row Write Flag Bit Position */
#define FCW_INTFLAG_FIFOERR_Msk               (_UINT32_(0x1) << FCW_INTFLAG_FIFOERR_Pos)           /* (FCW_INTFLAG) FIFO Underrun during Row Write Flag Bit Mask */
#define FCW_INTFLAG_FIFOERR(value)            (FCW_INTFLAG_FIFOERR_Msk & (_UINT32_(value) << FCW_INTFLAG_FIFOERR_Pos)) /* Assignment of value for FIFOERR in the FCW_INTFLAG register */
#define   FCW_INTFLAG_FIFOERR_0_Val           _UINT32_(0x0)                                        /* (FCW_INTFLAG) No FIFO Error  */
#define   FCW_INTFLAG_FIFOERR_1_Val           _UINT32_(0x1)                                        /* (FCW_INTFLAG) FIFO Error  */
#define FCW_INTFLAG_FIFOERR_0                 (FCW_INTFLAG_FIFOERR_0_Val << FCW_INTFLAG_FIFOERR_Pos) /* (FCW_INTFLAG) No FIFO Error Position */
#define FCW_INTFLAG_FIFOERR_1                 (FCW_INTFLAG_FIFOERR_1_Val << FCW_INTFLAG_FIFOERR_Pos) /* (FCW_INTFLAG) FIFO Error Position */
#define FCW_INTFLAG_BUSERR_Pos                _UINT32_(4)                                          /* (FCW_INTFLAG) AHB Bus Error during Row Write Flag Bit Position */
#define FCW_INTFLAG_BUSERR_Msk                (_UINT32_(0x1) << FCW_INTFLAG_BUSERR_Pos)            /* (FCW_INTFLAG) AHB Bus Error during Row Write Flag Bit Mask */
#define FCW_INTFLAG_BUSERR(value)             (FCW_INTFLAG_BUSERR_Msk & (_UINT32_(value) << FCW_INTFLAG_BUSERR_Pos)) /* Assignment of value for BUSERR in the FCW_INTFLAG register */
#define   FCW_INTFLAG_BUSERR_0_Val            _UINT32_(0x0)                                        /* (FCW_INTFLAG) No Bus Error  */
#define   FCW_INTFLAG_BUSERR_1_Val            _UINT32_(0x1)                                        /* (FCW_INTFLAG) Bus Error  */
#define FCW_INTFLAG_BUSERR_0                  (FCW_INTFLAG_BUSERR_0_Val << FCW_INTFLAG_BUSERR_Pos) /* (FCW_INTFLAG) No Bus Error Position */
#define FCW_INTFLAG_BUSERR_1                  (FCW_INTFLAG_BUSERR_1_Val << FCW_INTFLAG_BUSERR_Pos) /* (FCW_INTFLAG) Bus Error Position */
#define FCW_INTFLAG_WPERR_Pos                 _UINT32_(5)                                          /* (FCW_INTFLAG) Write Protection Error Flag Bit Position */
#define FCW_INTFLAG_WPERR_Msk                 (_UINT32_(0x1) << FCW_INTFLAG_WPERR_Pos)             /* (FCW_INTFLAG) Write Protection Error Flag Bit Mask */
#define FCW_INTFLAG_WPERR(value)              (FCW_INTFLAG_WPERR_Msk & (_UINT32_(value) << FCW_INTFLAG_WPERR_Pos)) /* Assignment of value for WPERR in the FCW_INTFLAG register */
#define   FCW_INTFLAG_WPERR_0_Val             _UINT32_(0x0)                                        /* (FCW_INTFLAG) No Write Protection Error  */
#define   FCW_INTFLAG_WPERR_1_Val             _UINT32_(0x1)                                        /* (FCW_INTFLAG) Write Protection Error  */
#define FCW_INTFLAG_WPERR_0                   (FCW_INTFLAG_WPERR_0_Val << FCW_INTFLAG_WPERR_Pos)   /* (FCW_INTFLAG) No Write Protection Error Position */
#define FCW_INTFLAG_WPERR_1                   (FCW_INTFLAG_WPERR_1_Val << FCW_INTFLAG_WPERR_Pos)   /* (FCW_INTFLAG) Write Protection Error Position */
#define FCW_INTFLAG_OPERR_Pos                 _UINT32_(6)                                          /* (FCW_INTFLAG) NVMOP Error Flag Bit Position */
#define FCW_INTFLAG_OPERR_Msk                 (_UINT32_(0x1) << FCW_INTFLAG_OPERR_Pos)             /* (FCW_INTFLAG) NVMOP Error Flag Bit Mask */
#define FCW_INTFLAG_OPERR(value)              (FCW_INTFLAG_OPERR_Msk & (_UINT32_(value) << FCW_INTFLAG_OPERR_Pos)) /* Assignment of value for OPERR in the FCW_INTFLAG register */
#define   FCW_INTFLAG_OPERR_0_Val             _UINT32_(0x0)                                        /* (FCW_INTFLAG) No NVMOP Error  */
#define   FCW_INTFLAG_OPERR_1_Val             _UINT32_(0x1)                                        /* (FCW_INTFLAG) Selected Operation is Disabled Error  */
#define FCW_INTFLAG_OPERR_0                   (FCW_INTFLAG_OPERR_0_Val << FCW_INTFLAG_OPERR_Pos)   /* (FCW_INTFLAG) No NVMOP Error Position */
#define FCW_INTFLAG_OPERR_1                   (FCW_INTFLAG_OPERR_1_Val << FCW_INTFLAG_OPERR_Pos)   /* (FCW_INTFLAG) Selected Operation is Disabled Error Position */
#define FCW_INTFLAG_HTDPGM_Pos                _UINT32_(8)                                          /* (FCW_INTFLAG) High Temperature Detect Error Flag Bit Position */
#define FCW_INTFLAG_HTDPGM_Msk                (_UINT32_(0x1) << FCW_INTFLAG_HTDPGM_Pos)            /* (FCW_INTFLAG) High Temperature Detect Error Flag Bit Mask */
#define FCW_INTFLAG_HTDPGM(value)             (FCW_INTFLAG_HTDPGM_Msk & (_UINT32_(value) << FCW_INTFLAG_HTDPGM_Pos)) /* Assignment of value for HTDPGM in the FCW_INTFLAG register */
#define   FCW_INTFLAG_HTDPGM_0_Val            _UINT32_(0x0)                                        /* (FCW_INTFLAG) High Temp NOT Detected  */
#define   FCW_INTFLAG_HTDPGM_1_Val            _UINT32_(0x1)                                        /* (FCW_INTFLAG) High Temp Detected (possible data corruption, verify operation)  */
#define FCW_INTFLAG_HTDPGM_0                  (FCW_INTFLAG_HTDPGM_0_Val << FCW_INTFLAG_HTDPGM_Pos) /* (FCW_INTFLAG) High Temp NOT Detected Position */
#define FCW_INTFLAG_HTDPGM_1                  (FCW_INTFLAG_HTDPGM_1_Val << FCW_INTFLAG_HTDPGM_Pos) /* (FCW_INTFLAG) High Temp Detected (possible data corruption, verify operation) Position */
#define FCW_INTFLAG_RSTERR_Pos                _UINT32_(12)                                         /* (FCW_INTFLAG) Reset or Brown Out Detect Error Flag Bit Position */
#define FCW_INTFLAG_RSTERR_Msk                (_UINT32_(0x1) << FCW_INTFLAG_RSTERR_Pos)            /* (FCW_INTFLAG) Reset or Brown Out Detect Error Flag Bit Mask */
#define FCW_INTFLAG_RSTERR(value)             (FCW_INTFLAG_RSTERR_Msk & (_UINT32_(value) << FCW_INTFLAG_RSTERR_Pos)) /* Assignment of value for RSTERR in the FCW_INTFLAG register */
#define   FCW_INTFLAG_RSTERR_0_Val            _UINT32_(0x0)                                        /* (FCW_INTFLAG) No Reset and Voltage level OK during write/erase  */
#define   FCW_INTFLAG_RSTERR_1_Val            _UINT32_(0x1)                                        /* (FCW_INTFLAG) A reset or Low Voltage Detected (possible data corruption, verify data)  */
#define FCW_INTFLAG_RSTERR_0                  (FCW_INTFLAG_RSTERR_0_Val << FCW_INTFLAG_RSTERR_Pos) /* (FCW_INTFLAG) No Reset and Voltage level OK during write/erase Position */
#define FCW_INTFLAG_RSTERR_1                  (FCW_INTFLAG_RSTERR_1_Val << FCW_INTFLAG_RSTERR_Pos) /* (FCW_INTFLAG) A reset or Low Voltage Detected (possible data corruption, verify data) Position */
#define FCW_INTFLAG_WRERR_Pos                 _UINT32_(13)                                         /* (FCW_INTFLAG) Write Error Flag Bit Position */
#define FCW_INTFLAG_WRERR_Msk                 (_UINT32_(0x1) << FCW_INTFLAG_WRERR_Pos)             /* (FCW_INTFLAG) Write Error Flag Bit Mask */
#define FCW_INTFLAG_WRERR(value)              (FCW_INTFLAG_WRERR_Msk & (_UINT32_(value) << FCW_INTFLAG_WRERR_Pos)) /* Assignment of value for WRERR in the FCW_INTFLAG register */
#define   FCW_INTFLAG_WRERR_0_Val             _UINT32_(0x0)                                        /* (FCW_INTFLAG) The Write/Erase sequence completed normally  */
#define   FCW_INTFLAG_WRERR_1_Val             _UINT32_(0x1)                                        /* (FCW_INTFLAG) The Write/Erase sequence did not complete successfully  */
#define FCW_INTFLAG_WRERR_0                   (FCW_INTFLAG_WRERR_0_Val << FCW_INTFLAG_WRERR_Pos)   /* (FCW_INTFLAG) The Write/Erase sequence completed normally Position */
#define FCW_INTFLAG_WRERR_1                   (FCW_INTFLAG_WRERR_1_Val << FCW_INTFLAG_WRERR_Pos)   /* (FCW_INTFLAG) The Write/Erase sequence did not complete successfully Position */
#define FCW_INTFLAG_Msk                       _UINT32_(0x0000317F)                                 /* (FCW_INTFLAG) Register Mask  */


/* -------- FCW_INTFLAGSET : (FCW Offset: 0x18) (R/W 32) Interrupt Flag Set REGISTER -------- */
#define FCW_INTFLAGSET_RESETVALUE             _UINT32_(0x00)                                       /*  (FCW_INTFLAGSET) Interrupt Flag Set REGISTER  Reset Value */

#define FCW_INTFLAGSET_DONE_Pos               _UINT32_(0)                                          /* (FCW_INTFLAGSET) NVM Operation Done Set Flag Bit Position */
#define FCW_INTFLAGSET_DONE_Msk               (_UINT32_(0x1) << FCW_INTFLAGSET_DONE_Pos)           /* (FCW_INTFLAGSET) NVM Operation Done Set Flag Bit Mask */
#define FCW_INTFLAGSET_DONE(value)            (FCW_INTFLAGSET_DONE_Msk & (_UINT32_(value) << FCW_INTFLAGSET_DONE_Pos)) /* Assignment of value for DONE in the FCW_INTFLAGSET register */
#define   FCW_INTFLAGSET_DONE_0_Val           _UINT32_(0x0)                                        /* (FCW_INTFLAGSET) No effect  */
#define   FCW_INTFLAGSET_DONE_1_Val           _UINT32_(0x1)                                        /* (FCW_INTFLAGSET) Set Interrupt Pending  */
#define FCW_INTFLAGSET_DONE_0                 (FCW_INTFLAGSET_DONE_0_Val << FCW_INTFLAGSET_DONE_Pos) /* (FCW_INTFLAGSET) No effect Position */
#define FCW_INTFLAGSET_DONE_1                 (FCW_INTFLAGSET_DONE_1_Val << FCW_INTFLAGSET_DONE_Pos) /* (FCW_INTFLAGSET) Set Interrupt Pending Position */
#define FCW_INTFLAGSET_KEYERR_Pos             _UINT32_(1)                                          /* (FCW_INTFLAGSET) Key Error Set Flag Bit Position */
#define FCW_INTFLAGSET_KEYERR_Msk             (_UINT32_(0x1) << FCW_INTFLAGSET_KEYERR_Pos)         /* (FCW_INTFLAGSET) Key Error Set Flag Bit Mask */
#define FCW_INTFLAGSET_KEYERR(value)          (FCW_INTFLAGSET_KEYERR_Msk & (_UINT32_(value) << FCW_INTFLAGSET_KEYERR_Pos)) /* Assignment of value for KEYERR in the FCW_INTFLAGSET register */
#define   FCW_INTFLAGSET_KEYERR_0_Val         _UINT32_(0x0)                                        /* (FCW_INTFLAGSET) No effect  */
#define   FCW_INTFLAGSET_KEYERR_1_Val         _UINT32_(0x1)                                        /* (FCW_INTFLAGSET) Set Interrupt Pending  */
#define FCW_INTFLAGSET_KEYERR_0               (FCW_INTFLAGSET_KEYERR_0_Val << FCW_INTFLAGSET_KEYERR_Pos) /* (FCW_INTFLAGSET) No effect Position */
#define FCW_INTFLAGSET_KEYERR_1               (FCW_INTFLAGSET_KEYERR_1_Val << FCW_INTFLAGSET_KEYERR_Pos) /* (FCW_INTFLAGSET) Set Interrupt Pending Position */
#define FCW_INTFLAGSET_CFGERR_Pos             _UINT32_(2)                                          /* (FCW_INTFLAGSET) Configuration Error Set Flag Bit Position */
#define FCW_INTFLAGSET_CFGERR_Msk             (_UINT32_(0x1) << FCW_INTFLAGSET_CFGERR_Pos)         /* (FCW_INTFLAGSET) Configuration Error Set Flag Bit Mask */
#define FCW_INTFLAGSET_CFGERR(value)          (FCW_INTFLAGSET_CFGERR_Msk & (_UINT32_(value) << FCW_INTFLAGSET_CFGERR_Pos)) /* Assignment of value for CFGERR in the FCW_INTFLAGSET register */
#define   FCW_INTFLAGSET_CFGERR_0_Val         _UINT32_(0x0)                                        /* (FCW_INTFLAGSET) No effect  */
#define   FCW_INTFLAGSET_CFGERR_1_Val         _UINT32_(0x1)                                        /* (FCW_INTFLAGSET) Set Interrupt Pending  */
#define FCW_INTFLAGSET_CFGERR_0               (FCW_INTFLAGSET_CFGERR_0_Val << FCW_INTFLAGSET_CFGERR_Pos) /* (FCW_INTFLAGSET) No effect Position */
#define FCW_INTFLAGSET_CFGERR_1               (FCW_INTFLAGSET_CFGERR_1_Val << FCW_INTFLAGSET_CFGERR_Pos) /* (FCW_INTFLAGSET) Set Interrupt Pending Position */
#define FCW_INTFLAGSET_FIFOERR_Pos            _UINT32_(3)                                          /* (FCW_INTFLAGSET) FIFO Underrun during Row Write Set Flag Bit Position */
#define FCW_INTFLAGSET_FIFOERR_Msk            (_UINT32_(0x1) << FCW_INTFLAGSET_FIFOERR_Pos)        /* (FCW_INTFLAGSET) FIFO Underrun during Row Write Set Flag Bit Mask */
#define FCW_INTFLAGSET_FIFOERR(value)         (FCW_INTFLAGSET_FIFOERR_Msk & (_UINT32_(value) << FCW_INTFLAGSET_FIFOERR_Pos)) /* Assignment of value for FIFOERR in the FCW_INTFLAGSET register */
#define   FCW_INTFLAGSET_FIFOERR_0_Val        _UINT32_(0x0)                                        /* (FCW_INTFLAGSET) No effect  */
#define   FCW_INTFLAGSET_FIFOERR_1_Val        _UINT32_(0x1)                                        /* (FCW_INTFLAGSET) Set Interrupt Pending  */
#define FCW_INTFLAGSET_FIFOERR_0              (FCW_INTFLAGSET_FIFOERR_0_Val << FCW_INTFLAGSET_FIFOERR_Pos) /* (FCW_INTFLAGSET) No effect Position */
#define FCW_INTFLAGSET_FIFOERR_1              (FCW_INTFLAGSET_FIFOERR_1_Val << FCW_INTFLAGSET_FIFOERR_Pos) /* (FCW_INTFLAGSET) Set Interrupt Pending Position */
#define FCW_INTFLAGSET_BUSERR_Pos             _UINT32_(4)                                          /* (FCW_INTFLAGSET) AHB Bus Error during Row Write Set Flag Bit Position */
#define FCW_INTFLAGSET_BUSERR_Msk             (_UINT32_(0x1) << FCW_INTFLAGSET_BUSERR_Pos)         /* (FCW_INTFLAGSET) AHB Bus Error during Row Write Set Flag Bit Mask */
#define FCW_INTFLAGSET_BUSERR(value)          (FCW_INTFLAGSET_BUSERR_Msk & (_UINT32_(value) << FCW_INTFLAGSET_BUSERR_Pos)) /* Assignment of value for BUSERR in the FCW_INTFLAGSET register */
#define   FCW_INTFLAGSET_BUSERR_0_Val         _UINT32_(0x0)                                        /* (FCW_INTFLAGSET) No effect  */
#define   FCW_INTFLAGSET_BUSERR_1_Val         _UINT32_(0x1)                                        /* (FCW_INTFLAGSET) Set Interrupt Pending  */
#define FCW_INTFLAGSET_BUSERR_0               (FCW_INTFLAGSET_BUSERR_0_Val << FCW_INTFLAGSET_BUSERR_Pos) /* (FCW_INTFLAGSET) No effect Position */
#define FCW_INTFLAGSET_BUSERR_1               (FCW_INTFLAGSET_BUSERR_1_Val << FCW_INTFLAGSET_BUSERR_Pos) /* (FCW_INTFLAGSET) Set Interrupt Pending Position */
#define FCW_INTFLAGSET_WPERR_Pos              _UINT32_(5)                                          /* (FCW_INTFLAGSET) Write Protection Error Set Flag Bit Position */
#define FCW_INTFLAGSET_WPERR_Msk              (_UINT32_(0x1) << FCW_INTFLAGSET_WPERR_Pos)          /* (FCW_INTFLAGSET) Write Protection Error Set Flag Bit Mask */
#define FCW_INTFLAGSET_WPERR(value)           (FCW_INTFLAGSET_WPERR_Msk & (_UINT32_(value) << FCW_INTFLAGSET_WPERR_Pos)) /* Assignment of value for WPERR in the FCW_INTFLAGSET register */
#define   FCW_INTFLAGSET_WPERR_0_Val          _UINT32_(0x0)                                        /* (FCW_INTFLAGSET) No effect  */
#define   FCW_INTFLAGSET_WPERR_1_Val          _UINT32_(0x1)                                        /* (FCW_INTFLAGSET) Set Interrupt Pending  */
#define FCW_INTFLAGSET_WPERR_0                (FCW_INTFLAGSET_WPERR_0_Val << FCW_INTFLAGSET_WPERR_Pos) /* (FCW_INTFLAGSET) No effect Position */
#define FCW_INTFLAGSET_WPERR_1                (FCW_INTFLAGSET_WPERR_1_Val << FCW_INTFLAGSET_WPERR_Pos) /* (FCW_INTFLAGSET) Set Interrupt Pending Position */
#define FCW_INTFLAGSET_OPERR_Pos              _UINT32_(6)                                          /* (FCW_INTFLAGSET) NVMOP Error Set Flag Bit Position */
#define FCW_INTFLAGSET_OPERR_Msk              (_UINT32_(0x1) << FCW_INTFLAGSET_OPERR_Pos)          /* (FCW_INTFLAGSET) NVMOP Error Set Flag Bit Mask */
#define FCW_INTFLAGSET_OPERR(value)           (FCW_INTFLAGSET_OPERR_Msk & (_UINT32_(value) << FCW_INTFLAGSET_OPERR_Pos)) /* Assignment of value for OPERR in the FCW_INTFLAGSET register */
#define   FCW_INTFLAGSET_OPERR_0_Val          _UINT32_(0x0)                                        /* (FCW_INTFLAGSET) No effect  */
#define   FCW_INTFLAGSET_OPERR_1_Val          _UINT32_(0x1)                                        /* (FCW_INTFLAGSET) Set Interrupt Pending  */
#define FCW_INTFLAGSET_OPERR_0                (FCW_INTFLAGSET_OPERR_0_Val << FCW_INTFLAGSET_OPERR_Pos) /* (FCW_INTFLAGSET) No effect Position */
#define FCW_INTFLAGSET_OPERR_1                (FCW_INTFLAGSET_OPERR_1_Val << FCW_INTFLAGSET_OPERR_Pos) /* (FCW_INTFLAGSET) Set Interrupt Pending Position */
#define FCW_INTFLAGSET_HTDPGM_Pos             _UINT32_(8)                                          /* (FCW_INTFLAGSET) High Temperature Detect Error Set Flag Bit Position */
#define FCW_INTFLAGSET_HTDPGM_Msk             (_UINT32_(0x1) << FCW_INTFLAGSET_HTDPGM_Pos)         /* (FCW_INTFLAGSET) High Temperature Detect Error Set Flag Bit Mask */
#define FCW_INTFLAGSET_HTDPGM(value)          (FCW_INTFLAGSET_HTDPGM_Msk & (_UINT32_(value) << FCW_INTFLAGSET_HTDPGM_Pos)) /* Assignment of value for HTDPGM in the FCW_INTFLAGSET register */
#define   FCW_INTFLAGSET_HTDPGM_0_Val         _UINT32_(0x0)                                        /* (FCW_INTFLAGSET) No effect  */
#define   FCW_INTFLAGSET_HTDPGM_1_Val         _UINT32_(0x1)                                        /* (FCW_INTFLAGSET) Set Interrupt Pending  */
#define FCW_INTFLAGSET_HTDPGM_0               (FCW_INTFLAGSET_HTDPGM_0_Val << FCW_INTFLAGSET_HTDPGM_Pos) /* (FCW_INTFLAGSET) No effect Position */
#define FCW_INTFLAGSET_HTDPGM_1               (FCW_INTFLAGSET_HTDPGM_1_Val << FCW_INTFLAGSET_HTDPGM_Pos) /* (FCW_INTFLAGSET) Set Interrupt Pending Position */
#define FCW_INTFLAGSET_RSTERR_Pos             _UINT32_(12)                                         /* (FCW_INTFLAGSET) Reset or Brown Out Detect Error Set Flag Bit Position */
#define FCW_INTFLAGSET_RSTERR_Msk             (_UINT32_(0x1) << FCW_INTFLAGSET_RSTERR_Pos)         /* (FCW_INTFLAGSET) Reset or Brown Out Detect Error Set Flag Bit Mask */
#define FCW_INTFLAGSET_RSTERR(value)          (FCW_INTFLAGSET_RSTERR_Msk & (_UINT32_(value) << FCW_INTFLAGSET_RSTERR_Pos)) /* Assignment of value for RSTERR in the FCW_INTFLAGSET register */
#define   FCW_INTFLAGSET_RSTERR_0_Val         _UINT32_(0x0)                                        /* (FCW_INTFLAGSET) No effect  */
#define   FCW_INTFLAGSET_RSTERR_1_Val         _UINT32_(0x1)                                        /* (FCW_INTFLAGSET) Set Interrupt Pending  */
#define FCW_INTFLAGSET_RSTERR_0               (FCW_INTFLAGSET_RSTERR_0_Val << FCW_INTFLAGSET_RSTERR_Pos) /* (FCW_INTFLAGSET) No effect Position */
#define FCW_INTFLAGSET_RSTERR_1               (FCW_INTFLAGSET_RSTERR_1_Val << FCW_INTFLAGSET_RSTERR_Pos) /* (FCW_INTFLAGSET) Set Interrupt Pending Position */
#define FCW_INTFLAGSET_WRERR_Pos              _UINT32_(13)                                         /* (FCW_INTFLAGSET) Write Error Set Flag Bit Position */
#define FCW_INTFLAGSET_WRERR_Msk              (_UINT32_(0x1) << FCW_INTFLAGSET_WRERR_Pos)          /* (FCW_INTFLAGSET) Write Error Set Flag Bit Mask */
#define FCW_INTFLAGSET_WRERR(value)           (FCW_INTFLAGSET_WRERR_Msk & (_UINT32_(value) << FCW_INTFLAGSET_WRERR_Pos)) /* Assignment of value for WRERR in the FCW_INTFLAGSET register */
#define   FCW_INTFLAGSET_WRERR_0_Val          _UINT32_(0x0)                                        /* (FCW_INTFLAGSET) No effect  */
#define   FCW_INTFLAGSET_WRERR_1_Val          _UINT32_(0x1)                                        /* (FCW_INTFLAGSET) Set Interrupt Pending  */
#define FCW_INTFLAGSET_WRERR_0                (FCW_INTFLAGSET_WRERR_0_Val << FCW_INTFLAGSET_WRERR_Pos) /* (FCW_INTFLAGSET) No effect Position */
#define FCW_INTFLAGSET_WRERR_1                (FCW_INTFLAGSET_WRERR_1_Val << FCW_INTFLAGSET_WRERR_Pos) /* (FCW_INTFLAGSET) Set Interrupt Pending Position */
#define FCW_INTFLAGSET_Msk                    _UINT32_(0x0000317F)                                 /* (FCW_INTFLAGSET) Register Mask  */


